# Personal macOS bootstrap for this dotfiles repo.
# Keep this file intentionally small: only tools needed by the tracked configs.

tap "gentleman-programming/tap", "https://github.com/Gentleman-Programming/homebrew-tap", trusted: true
tap "modem-dev/tap"
tap "nikitabobko/tap"
tap "steipete/tap"

# Core CLI
brew "git"
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "curl"
brew "jq"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "fzf"
brew "sd"

# Shell and prompt
brew "fish"
brew "starship"
brew "atuin"
brew "zoxide"
brew "carapace"

# Editor and terminal workflow
brew "neovim"
brew "tmux"
brew "lazygit"
brew "herdr"
brew "modem-dev/tap/hunk", trusted: true

# Runtime/tooling used by editor and AI tools
brew "node"
brew "go"
brew "python@3.13"

# AI/dev harness used by this config
brew "gentleman-programming/tap/engram"
brew "gentleman-programming/tap/gentle-ai"
brew "worktrunk"

# macOS apps
cask "ghostty"
cask "nikitabobko/tap/aerospace"
cask "raycast"
cask "wezterm"
cask "codex"
cask "steipete/tap/codexbar"

# Fonts used by terminal/editor themes
cask "font-iosevka-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-go-mono-nerd-font"

# Global npm tools for AI/dev workflow
npm "@anthropic-ai/claude-code"
npm "@earendil-works/pi-coding-agent"
npm "@github/copilot"
npm "gentle-engram"
npm "gentle-pi"
npm "pi-intercom"
npm "pi-lens"
npm "pi-mcp-adapter"
npm "pi-subagents"
npm "pi-web-access"
